Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.AddLeg Method
Overload List
Name | Description
AddLeg(ConnectiveGeometry, Contour)
 Appends a polygon section to ConnectiveGeometry, using the maximal radius for the cylindrical connection.
AddLeg(ConnectiveGeometry, Contour, Double)
 Appends a polygon section to this ConnectiveGeometry, using the specified radius for the cylindrical connection.
AddLeg(ConnectiveGeometry, Contour, BentPlate.BendShape)
 Appends a polygon section to ConnectiveGeometry, using the maximal radius for the cylindrical connection, or the maximum cone aperture for conical connection.
AddLeg(ConnectiveGeometry, LineSegment, Contour, LineSegment)
 Appends a polygon section to this ConnectiveGeometry, using the specified connection points and maximal radius for the cylindrical connection.
AddLeg(ConnectiveGeometry, Contour, Double, Double)
 Joins a polygon section to this ConnectiveGeometry, using the specified radius and aperture for the conical connection.
AddLeg(ConnectiveGeometry, LineSegment, Contour, LineSegment, Double)
 Appends a polygon section to this ConnectiveGeometry, using the specified connection points and radius for the cylindrical connection.
AddLeg(ConnectiveGeometry, LineSegment, Contour, LineSegment, BentPlate.BendShape)
 Appends a polygon section to this ConnectiveGeometry, using the specified connection points and maximal radius for the cylindrical connection, or maximum aperture for conical connection.
AddLeg(ConnectiveGeometry, LineSegment, Contour, LineSegment, Double, Double)
 Joins a polygon section to this ConnectiveGeometry, using the specified connection points and radius and aperture for the conical connection.
Top
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace